zephyrproject-rtos/hal_infineon/aurix/tc3x/Sfr/TC39xB/IfxQspi_bf.h
/** \brief Mask for Ifx_QSPI_MCCON_Bits.IBLS */
#define IFX_QSPI_MCCON_IBLS_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.IBLS */
#define IFX_QSPI_MCCON_IBLS_OFF (19u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.IALEN */
#define IFX_QSPI_MCCON_IALEN_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.IALEN */
#define IFX_QSPI_MCCON_IALEN_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.IALEN */
#define IFX_QSPI_MCCON_IALEN_OFF (20u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.IALF */
#define IFX_QSPI_MCCON_IALF_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.IALF */
#define IFX_QSPI_MCCON_IALF_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.IALF */
#define IFX_QSPI_MCCON_IALF_OFF (21u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.IALC */
#define IFX_QSPI_MCCON_IALC_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.IALC */
#define IFX_QSPI_MCCON_IALC_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.IALC */
#define IFX_QSPI_MCCON_IALC_OFF (22u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.IALS */
#define IFX_QSPI_MCCON_IALS_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.IALS */
#define IFX_QSPI_MCCON_IALS_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.IALS */
#define IFX_QSPI_MCCON_IALS_OFF (23u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.T2EN */
#define IFX_QSPI_MCCON_T2EN_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.T2EN */
#define IFX_QSPI_MCCON_T2EN_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.T2EN */
#define IFX_QSPI_MCCON_T2EN_OFF (30u)

/** \brief Length for Ifx_QSPI_MCCON_Bits.MCEN */
#define IFX_QSPI_MCCON_MCEN_LEN (1u)

/** \brief Mask for Ifx_QSPI_MCCON_Bits.MCEN */
#define IFX_QSPI_MCCON_MCEN_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_MCCON_Bits.MCEN */
#define IFX_QSPI_MCCON_MCEN_OFF (31u)

/** \brief Length for Ifx_QSPI_OCS_Bits.SUS */
#define IFX_QSPI_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_QSPI_OCS_Bits.SUS */
#define IFX_QSPI_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_QSPI_OCS_Bits.SUS */
#define IFX_QSPI_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_QSPI_OCS_Bits.SUS_P */
#define IFX_QSPI_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_QSPI_OCS_Bits.SUS_P */
#define IFX_QSPI_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_OCS_Bits.SUS_P */
#define IFX_QSPI_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_QSPI_OCS_Bits.SUSSTA */
#define IFX_QSPI_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_QSPI_OCS_Bits.SUSSTA */
#define IFX_QSPI_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_OCS_Bits.SUSSTA */
#define IFX_QSPI_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_QSPI_KRSTCLR_Bits.CLR */
#define IFX_QSPI_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_QSPI_KRSTCLR_Bits.CLR */
#define IFX_QSPI_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_KRSTCLR_Bits.CLR */
#define IFX_QSPI_KRSTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_QSPI_KRST1_Bits.RST */
#define IFX_QSPI_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_QSPI_KRST1_Bits.RST */
#define IFX_QSPI_KRST1_RST_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_KRST1_Bits.RST */
#define IFX_QSPI_KRST1_RST_OFF (0u)

/** \brief Length for Ifx_QSPI_KRST0_Bits.RST */
#define IFX_QSPI_KRST0_RST_LEN (1u)

/** \brief Mask for Ifx_QSPI_KRST0_Bits.RST */
#define IFX_QSPI_KRST0_RST_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_KRST0_Bits.RST */
#define IFX_QSPI_KRST0_RST_OFF (0u)

/** \brief Length for Ifx_QSPI_KRST0_Bits.RSTSTAT */
#define IFX_QSPI_KRST0_RSTSTAT_LEN (1u)

/** \brief Mask for Ifx_QSPI_KRST0_Bits.RSTSTAT */
#define IFX_QSPI_KRST0_RSTSTAT_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_KRST0_Bits.RSTSTAT */
#define IFX_QSPI_KRST0_RSTSTAT_OFF (1u)

/** \brief Length for Ifx_QSPI_ACCEN0_Bits.EN0 */
#define IFX_QSPI_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_QSPI_ACCEN0_Bits.EN0 */
#define IFX_QSPI_ACCEN0_EN0_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_ACCEN0_Bits.EN0 */
#define IFX_QSPI_ACCEN0_EN0_OFF (0u)

/** \brief Length for Ifx_QSPI_ACCEN0_Bits.EN1 */
#define IFX_QSPI_ACCEN0_EN1_LEN (1u)

/** \brief Mask for Ifx_QSPI_ACCEN0_Bits.EN1 */
#define IFX_QSPI_ACCEN0_EN1_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_ACCEN0_Bits.EN1 */
#define IFX_QSPI_ACCEN0_EN1_OFF (1u)

/** \brief Length for Ifx_QSPI_ACCEN0_Bits.EN2 */
#define IFX_QSPI_ACCEN0_EN2_LEN (1u)

/** \brief Mask for Ifx_QSPI_ACCEN0_Bits.EN2 */
#define IFX_QSPI_ACCEN0_EN2_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_ACCEN0_Bits.EN2 */
#define IFX_QSPI_ACCEN0_EN2_OFF (2u)

/** \brief Length for Ifx_QSPI_ACCEN0_Bits.EN3 */
#define IFX_QSPI_ACCEN0_EN3_LEN (1u)

/** \brief Mask for Ifx_QSPI_ACCEN0_Bits.EN3 */
#define IFX_QSPI_ACCEN0_EN3_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_ACCEN0_Bits.EN3 */
#define IFX_QSPI_ACCEN0_EN3_OFF (3u)

/** \brief Length for Ifx_QSPI_ACCEN0_Bits.EN4 */
#define IFX_QSPI_ACCEN0_EN4_LEN (1u)

/** \brief Mask for Ifx_QSPI_ACCEN0_Bits.EN4 */
#define IFX_QSPI_ACCEN0_EN4_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_ACCEN0_Bits.EN4 */
#define IFX_QSPI_ACCEN0_EN4_OFF (4u)

/** \brief Length for Ifx_QSPI_ACCEN0_Bits.EN5 */
#define IFX_QSPI_ACCEN0_EN5_LEN (1u)

/** \brief Mask for Ifx_QSPI_ACCEN0_Bits.EN5 */
#define IFX_QSPI_ACCEN0_EN5_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_ACCEN0_Bits.EN5 */
#define IFX_QSPI_ACCEN0_EN5_OFF (5u)

/** \brief Length for Ifx_QSPI_ACCEN0_Bits.EN6 */
#define IFX_QSPI_ACCEN0_EN6_LEN (1u)

/** \brief Mask for Ifx_QSPI_ACCEN0_Bits.EN6 */
#define IFX_QSPI_ACCEN0_EN6_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_ACCEN0_Bits.EN6 */
#define IFX_QSPI_ACCEN0_EN6_OFF (6u)

/** \brief Length for Ifx_QSPI_ACCEN0_Bits.EN7 */
#define IFX_QSPI_ACCEN0_EN7_LEN (1u)

/** \brief Mask for Ifx_QSPI_ACCEN0_Bits.EN7 */
#define IFX_QSPI_ACCEN0_EN7_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_ACCEN0_Bits.EN7 */
#define IFX_QSPI_ACCEN0_EN7_OFF (7u)

/** \brief Length for Ifx_QSPI_ACCEN0_Bits.EN8 */
#define IFX_QSPI_ACCEN0_EN8_LEN (1u)

/** \brief Mask for Ifx_QSPI_ACCEN0_Bits.EN8 */
#define IFX_QSPI_ACCEN0_EN8_MSK (0x1u)

/** \brief Offset for Ifx_QSPI_ACCEN0_Bits.EN8 */
#define IFX_QSPI_ACCEN0_EN8_OFF (8u)

/** \brief Length for Ifx_QSPI_ACCEN0_Bits.EN9 */
#define IFX_QSPI_ACCEN0_EN9_LEN (1u)

